#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.infrastructure.module.elasticsearch.helm_release.fluentd_elasticsearch will be destroyed
  - resource "helm_release" "fluentd_elasticsearch" {
      - atomic                     = false -> null
      - chart                      = "fluentd-elasticsearch" -> null
      - cleanup_on_fail            = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "fluentd" -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - chart     = "fluentd-elasticsearch"
              - name      = "fluentd"
              - namespace = "logging"
              - revision  = 1
              - values    = jsonencode(
                    {
                      - elasticsearch = {
                          - auth = {
                              - enabled  = true
                              - password = "171X08VW4400f6AEKyZ2MKu7SR6cY5Dv"
                              - user     = "fluentd"
                            }
                          - host = "elasticsearch-master.default.svc.cluster.local"
                        }
                    }
                )
              - version   = "6.2.2"
            },
        ] -> null
      - name                       = "fluentd" -> null
      - namespace                  = "logging" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://kiwigrid.github.io" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - values                     = [
          - <<~EOT
                elasticsearch:
                  auth:
                    enabled: true
                    user: fluentd
                  host: elasticsearch-master.default.svc.cluster.local
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "6.2.2" -> null
      - wait                       = true -> null

      - set_sensitive {
          - name  = "elasticsearch.auth.password" -> null
          - value = (sensitive value)
        }
    }

  # module.infrastructure.module.elasticsearch.kubernetes_secret.elastic_credentials will be destroyed
  - resource "kubernetes_secret" "elastic_credentials" {
      - data = (sensitive value)
      - id   = "default/elastic-credentials" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "elastic-credentials" -> null
          - namespace        = "default" -> null
          - resource_version = "2255" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/elastic-credentials" -> null
          - uid              = "f25a3ae1-9f1a-4ac7-b104-c9e819e586a7" -> null
        }
    }

  # module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_internal_certificate will be destroyed
  - resource "kubernetes_secret" "elasticsearch_internal_certificate" {
      - data = (sensitive value)
      - id   = "default/elasticsearch-certificates" -> null
      - type = "Opaque" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "elasticsearch-certificates" -> null
          - namespace        = "default" -> null
          - resource_version = "2256" -> null
          - self_link        = "/api/v1/namespaces/default/secrets/elasticsearch-certificates" -> null
          - uid              = "4da39c37-3942-4639-8b71-956a00c727d4" -> null
        }
    }

  # module.infrastructure.module.elasticsearch.random_password.elasticsearch_password will be destroyed
  - resource "random_password" "elasticsearch_password" {
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 10 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.elasticsearch.random_password.kibana_encryption_key will be destroyed
  - resource "random_password" "kibana_encryption_key" {
      - id          = "none" -> null
      - length      = 32 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 10 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = (sensitive value)
      - special     = false -> null
      - upper       = true -> null
    }

  # module.infrastructure.module.language_service.kubernetes_deployment.language_service will be updated in-place
  ~ resource "kubernetes_deployment" "language_service" {
        id = "default/language-service"

        metadata {
            annotations      = {}
            generation       = 2
            labels           = {}
            name             = "language-service"
            namespace        = "default"
            resource_version = "67675"
            self_link        = "/apis/apps/v1/namespaces/default/deployments/language-service"
            uid              = "f03ee73a-27de-4f7d-bfd5-af4fd986dca2"
        }

      ~ spec {
            min_ready_seconds         = 0
            paused                    = false
            progress_deadline_seconds = 600
            replicas                  = 2
            revision_history_limit    = 10

            selector {
                match_labels = {
                    "app" = "language-service"
                }
            }

            strategy {
                type = "RollingUpdate"

                rolling_update {
                    max_surge       = "25%"
                    max_unavailable = "25%"
                }
            }

          ~ template {
                metadata {
                    annotations = {}
                    generation  = 0
                    labels      = {
                        "app" = "language-service"
                    }
                }

              ~ spec {
                    active_deadline_seconds          = 0
                    automount_service_account_token  = false
                    dns_policy                       = "ClusterFirst"
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                    node_selector                    = {}
                    restart_policy                   = "Always"
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                  ~ container {
                        args                     = []
                        command                  = []
                        image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-language-service:latest"
                        image_pull_policy        = "Always"
                        name                     = "language-service"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                        env {
                            name = "AUTH_TOKEN"

                            value_from {

                                secret_key_ref {
                                    key  = "local_connection_token"
                                    name = "local-connection-token"
                                }
                            }
                        }
                      ~ env {
                            name  = "ELASTICSEARCH_URL"
                          ~ value = "http://elasticsearch-master.default.svc.cluster.local:9200" -> "http://language-content-es-http.default.svc.cluster.local:9200"
                        }
                        env {
                            name = "ELASTICSEARCH_USERNAME"

                            value_from {

                                secret_key_ref {
                                    key  = "username"
                                    name = "language-service-elastic-credentials"
                                }
                            }
                        }
                        env {
                            name = "ELASTICSEARCH_PASSWORD"

                            value_from {

                                secret_key_ref {
                                    key  = "password"
                                    name = "language-service-elastic-credentials"
                                }
                            }
                        }

                        liveness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 30
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                            http_get {
                                path   = "/health"
                                port   = "8000"
                                scheme = "HTTP"
                            }
                        }

                        port {
                            container_port = 8000
                            host_port      = 0
                            protocol       = "TCP"
                        }

                        readiness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 30
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                            http_get {
                                path   = "/health"
                                port   = "8000"
                                scheme = "HTTP"
                            }
                        }

                        resources {
                            limits {
                                memory = "1288490188800m"
                            }

                            requests {
                                memory = "800Mi"
                            }
                        }
                    }

                    image_pull_secrets {
                        name = "aws-registry"
                    }
                }
            }
        }
    }

  # module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch will be created
  + resource "helm_release" "fluentd_elasticsearch" {
      + atomic                     = false
      + chart                      = "fluentd-elasticsearch"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fluentd"
      + namespace                  = "logging"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kiwigrid.github.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<~EOT
                elasticsearch:
                  auth:
                    enabled: true
                    user: fluentd
                  host: logs-es-http.logging.svc.cluster.local
            EOT,
        ]
      + verify                     = false
      + version                    = "6.2.2"
      + wait                       = true

      + set_sensitive {
          + name  = "elasticsearch.auth.password"
          + value = (sensitive value)
        }
    }

  # module.infrastructure.module.monitoring.kubernetes_namespace.monitoring will be destroyed
  - resource "kubernetes_namespace" "monitoring" {
      - id = "monitoring" -> null

      - metadata {
          - annotations      = {
              - "name" = "monitoring"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "monitoring" -> null
          - resource_version = "2268" -> null
          - self_link        = "/api/v1/namespaces/monitoring" -> null
          - uid              = "84c2cb07-547f-4e0f-a353-13430771a0ff" -> null
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 6 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
